{
    "Description": "In this file, recipes of various dishes used in NaiCafe is available.",
    "Categories":[
        {
            "category": "Indian Breads",
            "Items":[
                {
                    "itemname": "Soft Chappathi",
                    "Ingredients":[
                        "1 Cup Whole Wheat Flour, Atta",
                        "1/2 Cup Water, at room temperature",
                        "1 Teaspoon salt"
                    ],
                    "Recipe":[
                        "1. Put one cup of flour in a bowl. Add half a cup of water and mix with a spoon. When there is no more water visible, stop mixing. Cover the bowl and let it rest for 30 minutes.",
                        "2. After 30 minutes, add the salt, gently mix the dough for 2 minutes, just enough to gather the dough into one piece. Cover the bowl and set aside for 30 minutes",
                        "3. Divide the dough into lime size balls. Set an iron pan on medium high heat. Let it become hot. Take a dough ball and generously dust it with flour. Roll the dough into a 4 inch round on a flat smooth surface using a rolling pin. Place the chapati on the hot griddle. Let it cook for 10-15 seconds until bubbles starts to form on top. Flip the chapati and cook for 30 seconds more. Gently press on top of the chapati to make the chapati fluff up. Flip one more time and press on top. Chapati should beautifully fluff up. If making phulkas, just flip on direct flame and it will fluff up",
                        "4. Line a bowl with cotton towel. Place the cooked chapati on the bowl and cover with a towel. Chapati will stay beautifully soft for a long time"
                    ]
                },
                {
                    "itemname": "Perotta",
                    "Ingredients":[
                        "All Purpose Floor",
                        "Egg",
                        "Salt & Sugar",
                        "Oil",
                        "Milk",
                        "Baking Powder"
                    ],
                    "Recipe":[
                        "1. The dough for this paratha is made with all-purpose flour, egg, sugar, salt, oil, and milk.",
                        "2. Egg and Milk ARE added to the dough, as they make the paratha soft",
                        "3. The dough is then divided into equal parts and rolled out in a small roti.",
                        "4. Once the round roti is made, the circle is cut into thin strips using a knife",
                        "5. The stripes are gathered together and roll to make a ball. This ball is again rolled and cooked on a griddle or tawa using oil or ghee",
                        "6. Once it is cooked properly, it is pressed from both sides, so that the layers get separated from each other"
                    ]
                }
            ]
        },
        {
            "category": "Special Curries",
            "Items":[
                {
                    "itemname": "Paneer tikka masala",
                    "Ingredients":[
                        "tikka curry powder 3 tbsp",
                        "natural yogurt 2 tbsp",
                        "paneer 200g block, cut into small cubes",
                        "Vegetables",
                        "Passata 400 g"
                    ],
                    "Recipe":[
                        "1. Mix together 1 tbsp of tikka curry powder and the yogurt in a bowl, add the paneer and pepper, mix well and leave while you make the sauce.",
                        "2. Heat the oil in a pan and fry the onion until soft and going golden at the edges. Add the ginger and garlic, and cook for 2 minutes. Add another 2 tbsp of the curry powder and stir until the mixture smells fragrant then add the passata, tomato purée and sugar, and bring everything to a simmer. Cook for 10-15 minutes or until the sauce thickens, then add the cream and simmer gently for 2-3 minutes.",
                        "3. Heat the grill to high. Spread the paneer and pepper on a non-stick baking tray and grill, turning, until sizzling and charred at the edges",
                        "4. Add to the sauce, season and stir in a knob of butter and the coriander. Simmer for 2 minutes then serve with rice and naans."
                    ]
                },
                {
                    "itemname": "Spinach, Pea & Potato curry",
                    "Ingredients":[
                        "Onions, Garlic, Ginger, Green Chilli",
                        "Vegetable Oil",
                        "Chopped tomatoes, Charlotte Potateos, Chickpeas, Spinach",
                        "Cumin, Coriander, Turmeric, Lemon Juice"
                    ],
                    "Recipe":[
                        "1. Put the onion, garlic, ginger, chilli and 3 tbsp of water into a blender or food processor, and whizz until completely smooth.",
                        "2. Heat the vegetable oil in a large, deep, non-stick frying pan, carefully add the onion purée and cook for 10 minutes until reduced and golden. Add the spices and cook for 2 minutes, then tip in the chopped tomatoes and bring to a simmer.",
                        "3. Season and add the potatoes and chickpeas along with 1⁄2 a tin of water and simmer for 30 minutes until thickened and the potatoes have cooked through. Add the spinach and cook for a few minutes to wilt.",
                        "4. Stir in the lemon juice and garam masala, and serve with naans."
                    ]
                },
                {
                    "itemname": "Light Paneer Curry",
                    "Ingredients":[
                        "Paneer",
                        "Vegetables"
                    ],
                    "Recipe":[
                        "1. Put the rice into a pan with 300ml of water and a pinch of salt, and bring to a boil. Simmer for 1 minute then add a tight fitting lid and cook gently for 10 minutes. Remove from the heat and leave to steam for 10 minutes, then fluff up with a fork to serve.",
                        "2. Mix together the spices on a plate, then roll in the paneer, ensuring every cube is well coated. Heat the oil in a deep non-stick frying pan and fry the paneer for 4-5 minutes or until crisp. Scoop out onto a plate.",
                        "3. Put the onion, garlic and ginger into a food processor and whizz until smooth, then tip into the pan with any remaining spices from the plate. Cook for 10 minutes, stirring regularly, until darkened. Meanwhile, whizz the tomatoes in the food processor, then add to the pan. Add the paneer back in, along with the spinach, frozen peas and 250ml of water. Cook for 5 minutes until the peas have defrosted and spinach has wilted, then season, add the lemon juice and serve with the rice."
                    ]
                },
                {
                    "itemname": "Roast cauliflower korma",
                    "Ingredients":[
                        "Cauliflower",
                        "Oils",
                        "Spices"
                    ],
                    "Recipe":[
                        "1. Heat the oven to 200C/fan 180C/gas 6. Put the cauliflower florets and leaves in a bowl with 1 tbsp oil, 1 tsp of the turmeric and a good sprinkling of salt. Toss together then spread on a non-stick baking sheet and roast for 15-20 minutes or until browning at the edges and starting to become tender.",
                        "2. Meanwhile, heat 1 tbsp oil in a pan, add the cardamom and cumin seeds, and sizzle until fragrant. Add the onion and chilli, and cook until the onion is softened and lightly golden. Add the garlic and ginger, and cook for 2 minutes, then stir in the remaining turmeric and the rest of the spices.",
                        "3. Tip in the roasted cauli and stir well, then add the stock and almonds. Simmer for 5 minutes then stir in the yogurt and heat through gently. Stir in the coriander and serve with rice and naans."
                    ]
                },
                {
                    "itemname": "Sri Lankan vegan curry",
                    "Ingredients":[
                        "Vegetables",
                        "Sri Lankan Curry Powder"
                    ],
                    "Recipe":[
                        "1.To make the curry powder, dry-fry the spices and chilli in a non-stick frying pan until fragrant and darkened a little. Tip out of the pan and cool. Add the rice to the pan and dry-fry until pale golden. Cool. Tip everything into a spice or coffee grinder and whizz to a powder.",
                        "2. Heat 3 tbsp oil in a large pan. Add the onions and cook until soft and golden, about 10 minutes. Add the garlic and chilli and cook for 3 minutes, then stir in 2 tbsp of the curry powder and turmeric and keep stirring until you start to smell the spices.",
                        "3. Add the coconut milk and stock and bring to a simmer. Drop in the squash, cook for 4-5 minutes, then add the cauli and cook for 3-4 minutes. Add the beans and cook until just tender",
                        "4. To serve, heat another 2 tbsp of oil in a pan and fry the curry leaves and mustard seeds until they frazzle and begin to pop. Pour over the curry and serve with steamed rice"
                    ]
                },
                {
                    "itemname": "Mutter Paneer",
                    "Ingredients":[
                        "Paneer",
                        "Vegetables",
                        "Curry Powders",
                        "Spices",
                        "Oil"
                    ],
                    "Recipe":[
                        "1. Heat oil 1/2cm deep in a pan until it is shimmering hot and a cube of paneer will sizzle when you add it. Fry the paneer until it starts to turn brown at the edges. Don’t over do it or it will melt, and be careful as the oil will spit. Scoop the cheese out and drain it on kitchen paper.",
                        "2. Tip out the oil and then put the pan back on the heat.Add the ginger, cumin, turmeric, ground coriander and chilli powder and fry everything for a minute until the spices sizzle.Add the tinned tomatoes, break them up with a spoon and simmer everything for 5 minutes. Add the peas and simmer for a further 5 minutes, then stir in the paneer and garam masala and season well. Serve with naan, roti or rice."
                    ]
                },
                {
                    "itemname": "Aloo gobi with poached eggs",
                    "Ingredients":[
                        "Potatoes",
                        "Oils",
                        "Vegetables",
                        "Powders"
                    ],
                    "Recipe":[
                        "1. Cook the potatoes in boiling, salted water for 5 minutes, adding the cauliflower for the last 2 minutes, then drain well.",
                        "2. Heat the oil in a non-stick frying pan and fry the onion for 5 minutes. Add the chilli, garlic and ginger for a minute, then add the mustard seeds and spices. When the seeds start to pop, add the potato and cauliflower and coat in the spices. Season well and cook over a medium-low heat for 10-15 minutes until the potato and cauliflower is tender and the edges are golden and crisp. Meanwhile, poach 2 eggs, drain, and serve on top of the potatoes with a dollop of yogurt and scattered with coriander."
                    ]
                }
            ]
        },
        {
            "category": "Easy Breakfasts",
            "Items":[
                {
                    "itemname": "Breakfast No 1",
                    "Ingredients":[
                        "Ingredient 1",
                        "Ingredient 2",
                        "Ingredient 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 1",
                        "2. Step 2 for Breakfast 1",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Second Breakfast",
                    "Ingredients":[
                        "Ingredient 1",
                        "Ingredient 2",
                        "Ingredient 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 2",
                        "2. Step 2 for Breakfast 2",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Breakfast 3",
                    "Ingredients":[
                        "Item 1",
                        "Item 2",
                        "Item 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 3",
                        "2. Step 2 for Breakfast 3",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Breakfast No 4",
                    "Ingredients":[
                        "Ing 1",
                        "Ingredient 2",
                        "Ing 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 4",
                        "2. Step 2 for Breakfast 4",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Breakfast 5",
                    "Ingredients":[
                        "Ingredient 1",
                        "Ing 2",
                        "Ingredient 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 5",
                        "2. Step 2 for Breakfast 5",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Sixth Breakfast",
                    "Ingredients":[
                        "Ingredient 1",
                        "Ingredient 3"
                    ],
                    "Recipe":[
                        "1. This is the step 1 for Breakfast 6",
                        "2. Step 2 for Breakfast 6",
                        "3. Next step",
                        "4. Make the food & Server the dish"
                    ]
                },
                {
                    "itemname": "Special Breakfast",
                    "Ingredients":[
                        "Ingredient 1",
                        "Ingredient 2",
                        "Ingredient 3"
                    ],
                    "Recipe":[
                        "1. Step 1 for the special breakfast",
                        "2. Step 2 for Amazing breakfast",
                        "3. Next step in the making",
                        "4. Make the food & Server the breakfast!"
                    ]
                }
            ]
        },
        {
            "category": "Snacks",
            "Items":[
                {
                    "itemname": "Snack 1",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 2",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 3",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 4",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 5",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 6",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                },
                {
                    "itemname": "Snack 7",
                    "Ingredients":[
                        "Required Ingredients"
                    ],
                    "Recipe":[
                        "1. This is the",
                        "2. Recipe to",
                        "3. Make amazing",
                        "4. Snacks available at",
                        "5. Your own NaiCafe!"
                    ]
                }
            ]
        }
    ]
}